app/controllers/api/v1/owners_controller.rb

  def create
    @owner = Owner.new(owner_params)

    if @owner.save
---
INSERT INTO "owners" ("name", "phone", "email", "document_number", "type_document", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"